Ran Plan for project: `platform` dir: `2.platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # kubernetes_service_account.dashboard_admin has been deleted
- resource "kubernetes_service_account" "dashboard_admin" {
        id                              = "platform/dashboard-admin"
        # (1 unchanged attribute hidden)

      - metadata {
          - name             = "dashboard-admin" -> null
            # (6 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # helm_release.kubernetes_dashboard will be created
+ resource "helm_release" "kubernetes_dashboard" {
      + atomic                     = false
      + chart                      = "kubernetes-dashboard"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kubernetes-dashboard"
      + namespace                  = "platform"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/dashboard/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "api":
                  "containers":
                    "resources":
                      "limits":
                        "cpu": "250m"
                        "memory": "256Mi"
                      "requests":
                        "cpu": "100m"
                        "memory": "128Mi"
                "app":
                  "ingress":
                    "enabled": false
                "kong":
                  "enabled": false
                "metricsScraper":
                  "enabled": true
                "web":
                  "containers":
                    "resources":
                      "limits":
                        "cpu": "150m"
                        "memory": "128Mi"
                      "requests":
                        "cpu": "50m"
                        "memory": "64Mi"
            EOT,
        ]
      + verify                     = false
      + version                    = "7.10.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.oauth2_proxy[0] will be created
+ resource "helm_release" "oauth2_proxy" {
      + atomic                     = false
      + chart                      = "oauth2-proxy"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "oauth2-proxy"
      + namespace                  = "platform"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://oauth2-proxy.github.io/manifests"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "7.12.7"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.vault will be created
+ resource "helm_release" "vault" {
      + atomic                     = false
      + chart                      = "vault"
      + cleanup_on_fail            = true
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "vault"
      + namespace                  = "platform"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.releases.hashicorp.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "0.31.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_ingress_v1.dashboard will be created
+ resource "kubernetes_ingress_v1" "dashboard" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "cert-manager.io/cluster-issuer"                      = "letsencrypt-prod"
              + "traefik.ingress.kubernetes.io/router.middlewares"    = "platform-oauth2-proxy-auth@kubernetescrd"
              + "traefik.ingress.kubernetes.io/router.tls"            = "true"
              + "traefik.ingress.kubernetes.io/service.serversscheme" = "http"
            }
          + generation       = (known after apply)
          + name             = "kubernetes-dashboard"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "traefik"

          + rule {
              + host = "kdashboard.zitian.party"

              + http {
                  + path {
                      + path      = "/api/v1/login"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "kubernetes-dashboard-auth"

                              + port {
                                  + number = 8000
                                }
                            }
                        }
                    }
                  + path {
                      + path      = "/api/v1/csrftoken"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "kubernetes-dashboard-auth"

                              + port {
                                  + number = 8000
                                }
                            }
                        }
                    }
                  + path {
                      + path      = "/api/v1/me"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "kubernetes-dashboard-auth"

                              + port {
                                  + number = 8000
                                }
                            }
                        }
                    }
                  + path {
                      + path      = "/api"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "kubernetes-dashboard-api"

                              + port {
                                  + number = 8000
                                }
                            }
                        }
                    }
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "kubernetes-dashboard-web"

                              + port {
                                  + number = 8000
                                }
                            }
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "kdashboard.zitian.party",
                ]
              + secret_name = "dashboard-tls"
            }
        }
    }

  # kubernetes_ingress_v1.vault will be created
+ resource "kubernetes_ingress_v1" "vault" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "cert-manager.io/cluster-issuer" = "letsencrypt-prod"
            }
          + generation       = (known after apply)
          + name             = "vault-ingress"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "traefik"

          + rule {
              + host = "secrets.zitian.party"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "vault"

                              + port {
                                  + number = 8200
                                }
                            }
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "secrets.zitian.party",
                ]
              + secret_name = "vault-tls"
            }
        }
    }

  # kubernetes_manifest.oauth2_auth_middleware[0] will be created
+ resource "kubernetes_manifest" "oauth2_auth_middleware" {
      + manifest = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "Middleware"
          + metadata   = {
              + name      = "oauth2-proxy-auth"
              + namespace = "platform"
            }
          + spec       = {
              + forwardAuth = {
                  + address             = "http://oauth2-proxy.platform.svc.cluster.local/oauth2/auth"
                  + authResponseHeaders = [
                      + "X-Auth-Request-User",
                      + "X-Auth-Request-Email",
                      + "X-Auth-Request-Access-Token",
                    ]
                  + trustForwardHeader  = true
                }
            }
        }
      + object   = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "Middleware"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "oauth2-proxy-auth"
              + namespace                  = "platform"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + addPrefix         = {
                  + prefix = (known after apply)
                }
              + basicAuth         = {
                  + headerField  = (known after apply)
                  + realm        = (known after apply)
                  + removeHeader = (known after apply)
                  + secret       = (known after apply)
                }
              + buffering         = {
                  + maxRequestBodyBytes  = (known after apply)
                  + maxResponseBodyBytes = (known after apply)
                  + memRequestBodyBytes  = (known after apply)
                  + memResponseBodyBytes = (known after apply)
                  + retryExpression      = (known after apply)
                }
              + chain             = {
                  + middlewares = (known after apply)
                }
              + circuitBreaker    = {
                  + checkPeriod      = (known after apply)
                  + expression       = (known after apply)
                  + fallbackDuration = (known after apply)
                  + recoveryDuration = (known after apply)
                  + responseCode     = (known after apply)
                }
              + compress          = {
                  + defaultEncoding      = (known after apply)
                  + encodings            = (known after apply)
                  + excludedContentTypes = (known after apply)
                  + includedContentTypes = (known after apply)
                  + minResponseBodyBytes = (known after apply)
                }
              + contentType       = {
                  + autoDetect = (known after apply)
                }
              + digestAuth        = {
                  + headerField  = (known after apply)
                  + realm        = (known after apply)
                  + removeHeader = (known after apply)
                  + secret       = (known after apply)
                }
              + errors            = {
                  + query          = (known after apply)
                  + service        = {
                      + healthCheck        = {
                          + followRedirects   = (known after apply)
                          + headers           = (known after apply)
                          + hostname          = (known after apply)
                          + interval          = (known after apply)
                          + method            = (known after apply)
                          + mode              = (known after apply)
                          + path              = (known after apply)
                          + port              = (known after apply)
                          + scheme            = (known after apply)
                          + status            = (known after apply)
                          + timeout           = (known after apply)
                          + unhealthyInterval = (known after apply)
                        }
                      + kind               = (known after apply)
                      + name               = (known after apply)
                      + namespace          = (known after apply)
                      + nativeLB           = (known after apply)
                      + nodePortLB         = (known after apply)
                      + passHostHeader     = (known after apply)
                      + port               = (known after apply)
                      + responseForwarding = {
                          + flushInterval = (known after apply)
                        }
                      + scheme             = (known after apply)
                      + serversTransport   = (known after apply)
                      + sticky             = {
                          + cookie = {
                              + domain   = (known after apply)
                              + httpOnly = (known after apply)
                              + maxAge   = (known after apply)
                              + name     = (known after apply)
                              + path     = (known after apply)
                              + sameSite = (known after apply)
                              + secure   = (known after apply)
                            }
                        }
                      + strategy           = (known after apply)
                      + weight             = (known after apply)
                    }
                  + status         = (known after apply)
                  + statusRewrites = (known after apply)
                }
              + forwardAuth       = {
                  + addAuthCookiesToResponse = (known after apply)
                  + address                  = "http://oauth2-proxy.platform.svc.cluster.local/oauth2/auth"
                  + authRequestHeaders       = (known after apply)
                  + authResponseHeaders      = [
                      + "X-Auth-Request-User",
                      + "X-Auth-Request-Email",
                      + "X-Auth-Request-Access-Token",
                    ]
                  + authResponseHeadersRegex = (known after apply)
                  + forwardBody              = (known after apply)
                  + headerField              = (known after apply)
                  + maxBodySize              = (known after apply)
                  + preserveLocationHeader   = (known after apply)
                  + preserveRequestMethod    = (known after apply)
                  + tls                      = {
                      + caOptional         = (known after apply)
                      + caSecret           = (known after apply)
                      + certSecret         = (known after apply)
                      + insecureSkipVerify = (known after apply)
                    }
                  + trustForwardHeader       = true
                }
              + grpcWeb           = {
                  + allowOrigins = (known after apply)
                }
              + headers           = {
                  + accessControlAllowCredentials     = (known after apply)
                  + accessControlAllowHeaders         = (known after apply)
                  + accessControlAllowMethods         = (known after apply)
                  + accessControlAllowOriginList      = (known after apply)
                  + accessControlAllowOriginListRegex = (known after apply)
                  + accessControlExposeHeaders        = (known after apply)
                  + accessControlMaxAge               = (known after apply)
                  + addVaryHeader                     = (known after apply)
                  + allowedHosts                      = (known after apply)
                  + browserXssFilter                  = (known after apply)
                  + contentSecurityPolicy             = (known after apply)
                  + contentSecurityPolicyReportOnly   = (known after apply)
                  + contentTypeNosniff                = (known after apply)
                  + customBrowserXSSValue             = (known after apply)
                  + customFrameOptionsValue           = (known after apply)
                  + customRequestHeaders              = (known after apply)
                  + customResponseHeaders             = (known after apply)
                  + featurePolicy                     = (known after apply)
                  + forceSTSHeader                    = (known after apply)
                  + frameDeny                         = (known after apply)
                  + hostsProxyHeaders                 = (known after apply)
                  + isDevelopment                     = (known after apply)
                  + permissionsPolicy                 = (known after apply)
                  + publicKey                         = (known after apply)
                  + referrerPolicy                    = (known after apply)
                  + sslForceHost                      = (known after apply)
                  + sslHost                           = (known after apply)
                  + sslProxyHeaders                   = (known after apply)
                  + sslRedirect                       = (known after apply)
                  + sslTemporaryRedirect              = (known after apply)
                  + stsIncludeSubdomains              = (known after apply)
                  + stsPreload                        = (known after apply)
                  + stsSeconds                        = (known after apply)
                }
              + inFlightReq       = {
                  + amount          = (known after apply)
                  + sourceCriterion = {
                      + ipStrategy        = {
                          + depth       = (known after apply)
                          + excludedIPs = (known after apply)
                          + ipv6Subnet  = (known after apply)
                        }
                      + requestHeaderName = (known after apply)
                      + requestHost       = (known after apply)
                    }
                }
              + ipAllowList       = {
                  + ipStrategy       = {
                      + depth       = (known after apply)
                      + excludedIPs = (known after apply)
                      + ipv6Subnet  = (known after apply)
                    }
                  + rejectStatusCode = (known after apply)
                  + sourceRange      = (known after apply)
                }
              + ipWhiteList       = {
                  + ipStrategy  = {
                      + depth       = (known after apply)
                      + excludedIPs = (known after apply)
                      + ipv6Subnet  = (known after apply)
                    }
                  + sourceRange = (known after apply)
                }
              + passTLSClientCert = {
                  + info = {
                      + issuer       = {
                          + commonName      = (known after apply)
                          + country         = (known after apply)
                          + domainComponent = (known after apply)
                          + locality        = (known after apply)
                          + organization    = (known after apply)
                          + province        = (known after apply)
                          + serialNumber    = (known after apply)
                        }
                      + notAfter     = (known after apply)
                      + notBefore    = (known after apply)
                      + sans         = (known after apply)
                      + serialNumber = (known after apply)
                      + subject      = {
                          + commonName         = (known after apply)
                          + country            = (known after apply)
                          + domainComponent    = (known after apply)
                          + locality           = (known after apply)
                          + organization       = (known after apply)
                          + organizationalUnit = (known after apply)
                          + province           = (known after apply)
                          + serialNumber       = (known after apply)
                        }
                    }
                  + pem  = (known after apply)
                }
              + plugin            = (known after apply)
              + rateLimit         = {
                  + average         = (known after apply)
                  + burst           = (known after apply)
                  + period          = (known after apply)
                  + redis           = {
                      + db             = (known after apply)
                      + dialTimeout    = (known after apply)
                      + endpoints      = (known after apply)
                      + maxActiveConns = (known after apply)
                      + minIdleConns   = (known after apply)
                      + poolSize       = (known after apply)
                      + readTimeout    = (known after apply)
                      + secret         = (known after apply)
                      + tls            = {
                          + caSecret           = (known after apply)
                          + certSecret         = (known after apply)
                          + insecureSkipVerify = (known after apply)
                        }
                      + writeTimeout   = (known after apply)
                    }
                  + sourceCriterion = {
                      + ipStrategy        = {
                          + depth       = (known after apply)
                          + excludedIPs = (known after apply)
                          + ipv6Subnet  = (known after apply)
                        }
                      + requestHeaderName = (known after apply)
                      + requestHost       = (known after apply)
                    }
                }
              + redirectRegex     = {
                  + permanent   = (known after apply)
                  + regex       = (known after apply)
                  + replacement = (known after apply)
                }
              + redirectScheme    = {
                  + permanent = (known after apply)
                  + port      = (known after apply)
                  + scheme    = (known after apply)
                }
              + replacePath       = {
                  + path = (known after apply)
                }
              + replacePathRegex  = {
                  + regex       = (known after apply)
                  + replacement = (known after apply)
                }
              + retry             = {
                  + attempts        = (known after apply)
                  + initialInterval = (known after apply)
                }
              + stripPrefix       = {
                  + forceSlash = (known after apply)
                  + prefixes   = (known after apply)
                }
              + stripPrefixRegex  = {
                  + regex = (known after apply)
                }
            }
        }
    }

  # kubernetes_secret.dashboard_admin_token will be created
+ resource "kubernetes_secret" "dashboard_admin_token" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "kubernetes.io/service-account-token"
      + wait_for_service_account_token = true

      + metadata {
          + annotations      = {
              + "kubernetes.io/service-account.name" = "dashboard-admin"
            }
          + generation       = (known after apply)
          + name             = "dashboard-admin-token"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.dashboard will be created
+ resource "kubernetes_service_account" "dashboard" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "kubernetes-dashboard"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.dashboard_admin will be created
+ resource "kubernetes_service_account" "dashboard_admin" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "dashboard-admin"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 9 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`